"""
Задание №1
✔ Пользователь вводит строку из четырёх или более
целых чисел, разделённых символом “/”. Сформируйте словарь, где:
✔второе и третье число являются ключами.
✔первое число является значением для первого ключа.
✔четвертое и все возможные последующие числа хранятся в кортеже как значения второго ключа.
"""


def make_dict(text: str) -> dict[int:int]:
    first, second, third, *other = (int(i) for i in text.split('/'))
    return {second: first, third: tuple(other)}


text = '3/5/7/8/10/12/13'
print(make_dict(text))
